MASTER_FILE.org
#+STARTUP: overview
 <pre class="example"style="background-color:#eff0f1;">
#+ATTR_HTML: :style background-color:#666677;
#+Title: Radio_OctaGon
* Boot Server SuperCollier
#+NAME: sclang  Server::boot
#+BEGIN_SRC sclang  bootserver
// C-c C-,
Server.default.boot;
 s.boot;
#+END_SRC
* [[file:~/Radio/neuron.sh][neuron@Radio]]
- neuron@Radio is a zsh script that connects Jack with SuperCollider,mic,mamathronServer & PulseAudio And More
#+BEGIN_SRC sh  NeuroN Interconnect
#!/bin/zsh
#disconnect netjack from system palyback
jack_disconnect system:playback_1 netjack:capture_1
jack_disconnect system:playback_2 netjack:capture_2
# Mic to Sc  in_1 allready connect
jack_connect 'Jack Router':in_3 system:capture_1
jack_connect 'Jack Router':in_1 system:capture_2
#Second Input to Sc
jack_connect 'Jack Router':in_2 system:capture_1
jack_connect 'Jack Router':in_4 system:capture_2
# connect vlc
PIDS2=$(pidof vlc)
jack_disconnect vlc_"$PIDS2":out_1 system:playback_1
jack_disconnect vlc_"$PIDS2":out_2 system:playback_2
jack_connect 'Jack Router':in_5  vlc_"$PIDS2":out_1
jack_connect 'Jack Router':in_6  vlc_"$PIDS2":out_2
#Disconnect Connect Pulseaudio Sink
jack_disconnect 'PulseAudio JACK Sink':front-left system:playback_1
jack_disconnect 'PulseAudio JACK Sink':front-right system:playback_2
jack_connect 'Jack Router':in_8  'PulseAudio JACK Sink':front-right
jack_connect 'Jack Router':in_7  'PulseAudio JACK Sink':front-left
#Mamatron to SuperCollider &&  SuperCollider MonitortoMamathron

jack_connect netjack-01:capture_1 'Jack Router':in_9
jack_connect netjack-01:capture_2 'Jack Router':in_10

jack_connect  netjack-01:playback_1 'Jack Router':out_5
jack_connect  netjack-01:playback_2 'Jack Router':out_6
#connect neuron to octagon radio
jack_connect 'Jack Router':out_1 netjack:playback_1
jack_connect 'Jack Router':out_2 netjack:playback_2
# connect Supercollider out 3 & 4 to system:playback as Monitor
jack_connect 'Jack Router':out_3 system:playback_1
jack_connect 'Jack Router':out_4 system:playback_2
# Disconnect supercollider out to system
jack_disconnect 'Jack Router':out_1 system:playback_1
jack_disconnect 'Jack Router':out_2 system:playback_2
#Netjack Capture Octagon Monitor to SuperCollider
jack_connect netjack:capture_1 'Jack Router':in_11
jack_connect netjack:capture_2 'Jack Router':in_12
# Carla
jack_connect Carla:audio-in1 'Jack Router':out_3
jack_connect Carla:audio-in2 'Jack Router':out_4
jack_connect Carla:audio-out1 'Jack Router':in_7
jack_connect Carla:audio-out2 'Jack Router':in_8
#+END_SRC
* OctaGon Radio :radio:
** ProxySpace    [[file:~/.emacs.d/personal/postload/MASTER-FILE-170722.org][Master_file_Zannos.org]]
  :PROPERTIES:
  :DATE:     <2017-10-26 Πεμ 05:04>
  :END:
 C- c >  //show-post-buffer
#+BEGIN_SRC  sclang
p=ProxySpace.new(s);
 p.push;
 p.stop;p.release;
 #+E

 **  Επιστροφές (feedback) OctaGon Monitoring
#+BEGIN_SRC sclang Octagon Monitoring
~octmonit={AudioIn.ar([11,12])}
~octmonit.play(1,3);
~octmonit.stop;
#+END_SRC
**  Microphone :mic:
   :PROPERTIES:
   :ID:       213f482b-6de1-463b-9a2c-f764577ade14
   :eval-id:  2
   :END:
    #+   [[file:01OctaGon_org/mic.sc][Mic.sc ]]  (org-eval-this section) C-H-SPACE
#+BEGIN_SRC  sclang  MiC&Monitor
//Microphone of the  streamer Octagon.
~mic={AudioIn.ar([1,3])}
~micmonitor={AudioIn.ar([1,3])}
~mictomamathron={AudioIn.ar([1,3])}
~mictomamathron.play(4);
~mictomamathron.stop;
~mic.play(1,2);
~mic.stop;
~micmonitor.play(2);
~micmonitor.stop;
#+END_SRC
