MASTER_FILE.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Radio<sub>OctaGon</sub> Radio<sub>OctaGon</sub></title>
<!-- 2017-10-27 Παρ 16:04 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Eugene Tryfonides" />
</head>
<body>
<div id="content">
<h1 class="title">Radio<sub>OctaGon</sub> Radio<sub>OctaGon</sub></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Boot Server SuperCollier</a></li>
<li><a href="#sec-2">2. neuron@Radio</a></li>
<li><a href="#sec-3">3. OctaGon Radio&#xa0;&#xa0;&#xa0;<span class="tag"><span class="radio">radio</span></span></a>
<ul>
<li><a href="#sec-3-1">3.1. ProxySpace    Master<sub>file</sub><sub>Zannos</sub>.org</a></li>
<li><a href="#sec-3-2">3.2. Microphone&#xa0;&#xa0;&#xa0;<span class="tag"><span class="mic">mic</span></span></a></li>
<li><a href="#sec-3-3">3.3. Record Out</a></li>
<li><a href="#sec-3-4">3.4. MamathroN Server</a></li>
</ul>
</li>
<li><a href="#sec-4">4. org-source-fontify-buffer</a></li>
<li><a href="#sec-5">5. Github Configure</a></li>
<li><a href="#sec-6">6. Keybindings  :windmove:&#xa0;&#xa0;&#xa0;<span class="tag"><span class="buffermove">buffermove</span></span></a>
<ul>
<li><a href="#sec-6-1">6.1. Window move</a></li>
<li><a href="#sec-6-2">6.2. ace-window</a></li>
<li><a href="#sec-6-3">6.3. Hide-show block  code</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Org-sc Keys  org-sc.el    :org: :org-sc:</a></li>
<li><a href="#sec-8">8. Org-mode Keys&#xa0;&#xa0;&#xa0;<span class="tag"><span class="keys">keys</span></span></a></li>
<li><a href="#sec-9">9. 011<sub>untangle</sub><sub>tangle</sub>.el</a></li>
<li><a href="#sec-10">10. Artistic outputs and buggs</a>
<ul>
<li><a href="#sec-10-1">10.1. sclang</a></li>
<li><a href="#sec-10-2">10.2. jack<sub>lsp</sub> -c</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
&lt;pre class="example"style="background-color:#eff0f1;"&gt;
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Boot Server SuperCollier</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-sclang" id="sclang-Server::boot"><span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">C-c C-,</span>
<span style="color: #00d7af;">Server</span>.default.boot;
 s.boot;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <a href="file:///home/egelor/Radio/neuron.sh">neuron@Radio</a></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>neuron@Radio is a zsh script that connects Jack with SuperCollider,mic,mamathronServer &amp; PulseAudio And More
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">!/bin/</span><span style="color: #a1db00; font-weight: bold;">zsh</span>
<span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">disconnect netjack from system palyback</span>
jack_disconnect system:playback_1 netjack:capture_1
jack_disconnect system:playback_2 netjack:capture_2
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Mic to Sc  in_1 allready connect</span>
jack_connect <span style="color: #ff4ea3;">'Jack Router'</span>:in_3 system:capture_1
jack_connect <span style="color: #ff4ea3;">'Jack Router'</span>:in_1 system:capture_2
<span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">Second Input to Sc</span>
jack_connect <span style="color: #ff4ea3;">'Jack Router'</span>:in_2 system:capture_1
jack_connect <span style="color: #ff4ea3;">'Jack Router'</span>:in_4 system:capture_2
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">connect vlc</span>
<span style="color: #ff8700;">PIDS2</span>=$(pidof vlc)
jack_disconnect vlc_<span style="color: #ff4ea3;">"$PIDS2"</span>:out_1 system:playback_1
jack_disconnect vlc_<span style="color: #ff4ea3;">"$PIDS2"</span>:out_2 system:playback_2
jack_connect <span style="color: #ff4ea3;">'Jack Router'</span>:in_5  vlc_<span style="color: #ff4ea3;">"$PIDS2"</span>:out_1
jack_connect <span style="color: #ff4ea3;">'Jack Router'</span>:in_6  vlc_<span style="color: #ff4ea3;">"$PIDS2"</span>:out_2
<span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">Disconnect Connect Pulseaudio Sink</span>
jack_disconnect <span style="color: #ff4ea3;">'PulseAudio JACK Sink'</span>:front-left system:playback_1
jack_disconnect <span style="color: #ff4ea3;">'PulseAudio JACK Sink'</span>:front-right system:playback_2
jack_connect <span style="color: #ff4ea3;">'Jack Router'</span>:in_8  <span style="color: #ff4ea3;">'PulseAudio JACK Sink'</span>:front-right
jack_connect <span style="color: #ff4ea3;">'Jack Router'</span>:in_7  <span style="color: #ff4ea3;">'PulseAudio JACK Sink'</span>:front-left
<span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">Mamatron to SuperCollider &amp;&amp;  SuperCollider MonitortoMamathron</span>

jack_connect netjack-01:capture_1 <span style="color: #ff4ea3;">'Jack Router'</span>:in_9
jack_connect netjack-01:capture_2 <span style="color: #ff4ea3;">'Jack Router'</span>:in_10

jack_connect  netjack-01:playback_1 <span style="color: #ff4ea3;">'Jack Router'</span>:out_5
jack_connect  netjack-01:playback_2 <span style="color: #ff4ea3;">'Jack Router'</span>:out_6
<span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">connect neuron to octagon radio</span>
jack_connect <span style="color: #ff4ea3;">'Jack Router'</span>:out_1 netjack:playback_1
jack_connect <span style="color: #ff4ea3;">'Jack Router'</span>:out_2 netjack:playback_2
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">connect Supercollider out 3 &amp; 4 to system:playback as Monitor</span>
jack_connect <span style="color: #ff4ea3;">'Jack Router'</span>:out_3 system:playback_1
jack_connect <span style="color: #ff4ea3;">'Jack Router'</span>:out_4 system:playback_2
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Disconnect supercollider out to system</span>
jack_disconnect <span style="color: #ff4ea3;">'Jack Router'</span>:out_1 system:playback_1
jack_disconnect <span style="color: #ff4ea3;">'Jack Router'</span>:out_2 system:playback_2
<span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">Netjack Capture Octagon Monitor to SuperCollider</span>
jack_connect netjack:capture_1 <span style="color: #ff4ea3;">'Jack Router'</span>:in_11
jack_connect netjack:capture_2 <span style="color: #ff4ea3;">'Jack Router'</span>:in_12
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Carla</span>
jack_connect Carla:audio-in1 <span style="color: #ff4ea3;">'Jack Router'</span>:out_3
jack_connect Carla:audio-in2 <span style="color: #ff4ea3;">'Jack Router'</span>:out_4
jack_connect Carla:audio-out1 <span style="color: #ff4ea3;">'Jack Router'</span>:in_7
jack_connect Carla:audio-out2 <span style="color: #ff4ea3;">'Jack Router'</span>:in_8
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> OctaGon Radio&#xa0;&#xa0;&#xa0;<span class="tag"><span class="radio">radio</span></span></h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> ProxySpace    <a href="file:///home/egelor/.emacs.d/personal/postload/MASTER-FILE-170722.html">Master<sub>file</sub><sub>Zannos</sub>.org</a></h3>
<div class="outline-text-3" id="text-3-1">
<p>
C- c &gt;  //show-post-buffer
</p>
<div class="org-src-container">

<pre class="src src-sclang">p=<span style="color: #00d7af;">ProxySpace</span>.new<span style="color: #dd0000; font-weight: bold;">(</span>s<span style="color: #dd0000; font-weight: bold;">)</span>;
 p.push;
 p.stop;p.release;
 #+E

 **  &#917;&#960;&#953;&#963;&#964;&#961;&#959;&#966;&#941;&#962; <span style="color: #dd0000; font-weight: bold;">(</span>feedback<span style="color: #dd0000; font-weight: bold;">)</span> OctaGon Monitoring
#+BEGIN_SRC sclang Octagon Monitoring
<span style="color: #ff8700;">~octmonit</span>=<span style="color: #dd0000; font-weight: bold;">{</span><span style="color: #00d7af;">AudioIn</span>.<span style="color: #ffd700;">ar</span><span style="color: #5fafd7; font-weight: bold;">(</span><span style="color: #a1db00; font-weight: bold;">[</span>11,12<span style="color: #a1db00; font-weight: bold;">]</span><span style="color: #5fafd7; font-weight: bold;">)</span><span style="color: #dd0000; font-weight: bold;">}</span>
<span style="color: #ff8700;">~octmonit</span>.play<span style="color: #dd0000; font-weight: bold;">(</span>1,3<span style="color: #dd0000; font-weight: bold;">)</span>;
<span style="color: #ff8700;">~octmonit</span>.stop;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><a id="ID-213f482b-6de1-463b-9a2c-f764577ade14" name="ID-213f482b-6de1-463b-9a2c-f764577ade14"></a><span class="section-number-3">3.2</span> Microphone&#xa0;&#xa0;&#xa0;<span class="tag"><span class="mic">mic</span></span></h3>
<div class="outline-text-3" id="text-3-2">
<p>
#+   <a href="01OctaGon_org/mic.sc">Mic.sc </a>  (org-eval-this section) C-H-SPACE
</p>
<div class="org-src-container">

<pre class="src src-sclang"><span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">Microphone of the  streamer Octagon.</span>
<span style="color: #ff8700;">~mic</span>=<span style="color: #dd0000; font-weight: bold;">{</span><span style="color: #00d7af;">AudioIn</span>.<span style="color: #ffd700;">ar</span><span style="color: #5fafd7; font-weight: bold;">(</span><span style="color: #a1db00; font-weight: bold;">[</span>1,3<span style="color: #a1db00; font-weight: bold;">]</span><span style="color: #5fafd7; font-weight: bold;">)</span><span style="color: #dd0000; font-weight: bold;">}</span>
<span style="color: #ff8700;">~micmonitor</span>=<span style="color: #dd0000; font-weight: bold;">{</span><span style="color: #00d7af;">AudioIn</span>.<span style="color: #ffd700;">ar</span><span style="color: #5fafd7; font-weight: bold;">(</span><span style="color: #a1db00; font-weight: bold;">[</span>1,3<span style="color: #a1db00; font-weight: bold;">]</span><span style="color: #5fafd7; font-weight: bold;">)</span><span style="color: #dd0000; font-weight: bold;">}</span>
<span style="color: #ff8700;">~mictomamathron</span>=<span style="color: #dd0000; font-weight: bold;">{</span><span style="color: #00d7af;">AudioIn</span>.<span style="color: #ffd700;">ar</span><span style="color: #5fafd7; font-weight: bold;">(</span><span style="color: #a1db00; font-weight: bold;">[</span>1,3<span style="color: #a1db00; font-weight: bold;">]</span><span style="color: #5fafd7; font-weight: bold;">)</span><span style="color: #dd0000; font-weight: bold;">}</span>
<span style="color: #ff8700;">~mictomamathron</span>.play<span style="color: #dd0000; font-weight: bold;">(</span>4<span style="color: #dd0000; font-weight: bold;">)</span>;
<span style="color: #ff8700;">~mictomamathron</span>.stop;
<span style="color: #ff8700;">~mic</span>.play<span style="color: #dd0000; font-weight: bold;">(</span>1,2<span style="color: #dd0000; font-weight: bold;">)</span>;
<span style="color: #ff8700;">~mic</span>.stop;
<span style="color: #ff8700;">~micmonitor</span>.play<span style="color: #dd0000; font-weight: bold;">(</span>2<span style="color: #dd0000; font-weight: bold;">)</span>;
<span style="color: #ff8700;">~micmonitor</span>.stop;
</pre>
</div>
</div>
</div>
