MASTER_FILE.org
**  Record Out
   :PROPERTIES:
   :DATE:     <2017-10-26 Πεμ 14:58>
   :END:
#+Name:Record (path)
#+Arguments: Is passed to prepareForRecord (above).
#+date:<2017-10-26 Πεμ>
#+BEGIN_SRC sclang  Rec
s.recHeaderFormat = "wav"
s.recChannels //default: 2) Must me called before preperForRecord
s.prepareForRecord;
s.record(0);
s.stopRecording;
#+END_SRC

**  MamathroN Server
#+BEGIN_SRC   sclang
~mamathron={AudioIn.ar([9,10])};
~mamathronmonitor={AudioIn.ar([9,10])};
~mamathron.play(0);
~mamathron.stop;
~mamathron.release;
~mamathronmonitor.play(2);
~mamathronmonitor.stop;
~mamathronmonitor.release;
#+END_SRC

# -----------------------------








* org-source-fontify-buffer
#+BEGIN_SRC emacs-lisp fontify
(setq org-src-fontify-natively t)
#+END_SRC

#+Title: Radio_OctaGon

* Github Configure
#+begin_src emacs-lisp
      (setq org-babel-sh-command "sh")
#+end_src
#+RESULTS:
: sh
#+BEGIN_SRC sh github
git config --global user.name "egelor"
#+END_SRC
#+RESULTS:
#+BEGIN_SRC sh github Config
git config --global user.emacs "e.trifonidis@gmail.com"
#+END_SRC
#+RESULTS:
#+BEGIN_SRC sh init add  commit
git init
# git add filename
git commit -m ";;Commit message"
#+END_SRC
#+BEGIN_SRC sh  remote add origin
git remote add origin https://github.com/egelor/OctagonRadio.git
git remote -v
#+END_SRC
#+RESULTS:
#+BEGIN_SRC sh  push origin master
git push origin master
#+END_SRC
git push -f origin master
#+RESULTS:

#+BEGIN_SRC sh

#+END_SRC
#+BEGIN_SRC sh ssh@git
 ssh -T  egelor@github.com
#+END_SRC
*   Keybindings  :windmove:                                      :buffermove:
**  Window move
#+BEGIN_SRC emacs-lisp  windowmove
(global-set-key (kbd "s-<") 'beginning-of-buffer)
(global-set-key (kbd "s->") 'end-of-buffer)
(global-set-key (kbd "s-S-<right>") 'windmove-right)
(global-set-key (kbd "s-S-<left>") 'windmove-left)
(global-set-key (kbd "s-S-<up>") 'windmove-up)
(global-set-key (kbd "s-S-<down>") 'windmove-down)
(global-set-key (kbd "s-M-<right>") 'buf-move-right)
(global-set-key (kbd "s-M-<left>") 'buf-move-left)
(global-set-key (kbd "s-M-<up>") 'buf-move-up)
(global-set-key (kbd "s-M-<down>") 'buf-move-down)
#+END_SRC
**  ace-window
#+BEGIN_SRC  emacs-lisp
(global-set-key (kbd "C-S-a c") 'ace-jump-char-mode)
(global-set-key (kbd "C-S-a w") 'ace-jump-word-mode)
(global-set-key (kbd "C-S-a l") 'ace-jump-line-mode)
(global-set-key (kbd "C-S-a b") 'ace-jump-buffer)
(global-set-key (kbd "C-S-a d") 'ace-window)
(global-set-key (kbd "C-S-a W") 'ace-window)
(global-set-key (kbd "C-S-a s") 'switch-window)
(global-set-key (kbd "s-W") 'switch-window) ;; related to  ace-window s-w
#+END_SRC
