MASTER_FILE.html
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Record Out</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-sclang">s.recHeaderFormat = <span style="color: #ff4ea3;">"wav"</span>
s.recChannels <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">default: 2) Must me called before preperForRecord</span>
s.prepareForRecord;
s.record<span style="color: #dd0000; font-weight: bold;">(</span>0<span style="color: #dd0000; font-weight: bold;">)</span>;
s.stopRecording;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> MamathroN Server</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">

<pre class="src src-sclang"><span style="color: #ff8700;">~mamathron</span>=<span style="color: #dd0000; font-weight: bold;">{</span><span style="color: #00d7af;">AudioIn</span>.<span style="color: #ffd700;">ar</span><span style="color: #5fafd7; font-weight: bold;">(</span><span style="color: #a1db00; font-weight: bold;">[</span>9,10<span style="color: #a1db00; font-weight: bold;">]</span><span style="color: #5fafd7; font-weight: bold;">)</span><span style="color: #dd0000; font-weight: bold;">}</span>;
<span style="color: #ff8700;">~mamathronmonitor</span>=<span style="color: #dd0000; font-weight: bold;">{</span><span style="color: #00d7af;">AudioIn</span>.<span style="color: #ffd700;">ar</span><span style="color: #5fafd7; font-weight: bold;">(</span><span style="color: #a1db00; font-weight: bold;">[</span>9,10<span style="color: #a1db00; font-weight: bold;">]</span><span style="color: #5fafd7; font-weight: bold;">)</span><span style="color: #dd0000; font-weight: bold;">}</span>;
<span style="color: #ff8700;">~mamathron</span>.play<span style="color: #dd0000; font-weight: bold;">(</span>0<span style="color: #dd0000; font-weight: bold;">)</span>;
<span style="color: #ff8700;">~mamathron</span>.stop;
<span style="color: #ff8700;">~mamathron</span>.release;
<span style="color: #ff8700;">~mamathronmonitor</span>.play<span style="color: #dd0000; font-weight: bold;">(</span>2<span style="color: #dd0000; font-weight: bold;">)</span>;
<span style="color: #ff8700;">~mamathronmonitor</span>.stop;
<span style="color: #ff8700;">~mamathronmonitor</span>.release;
</pre>
</div>
</div>
</div>
</div>








<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> org-source-fontify-buffer</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #dd0000; font-weight: bold;">(</span>setq org-src-fontify-natively t<span style="color: #dd0000; font-weight: bold;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Github Configure</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #dd0000; font-weight: bold;">(</span>setq org-babel-sh-command <span style="color: #ff4ea3;">"sh"</span><span style="color: #dd0000; font-weight: bold;">)</span>
</pre>
</div>
<p>
git config &#x2013;global user.name "egelor"
#+END<sub>SRC</sub>
</p>
<div class="org-src-container">

<pre class="src src-sh">git config --global user.emacs <span style="color: #ff4ea3;">"e.trifonidis@gmail.com"</span>
</pre>
</div>
<p>
git remote add origin <a href="https://github.com/egelor/OctagonRadio.git">https://github.com/egelor/OctagonRadio.git</a>
git remote -v
#+END<sub>SRC</sub>
</p>
<div class="org-src-container">

<pre class="src src-sh">git push origin master
</pre>
</div>
<p>
git push -f origin master
</p>
<div class="org-src-container">

<pre class="src src-sh"></pre>
</div>
<div class="org-src-container">

<pre class="src src-sh">ssh -T  egelor@github.com
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Keybindings  :windmove:&#xa0;&#xa0;&#xa0;<span class="tag"><span class="buffermove">buffermove</span></span></h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Window move</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-&lt;"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'beginning-of-buffer<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-&gt;"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'end-of-buffer<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-S-&lt;right&gt;"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'windmove-right<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-S-&lt;left&gt;"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'windmove-left<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-S-&lt;up&gt;"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'windmove-up<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-S-&lt;down&gt;"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'windmove-down<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-M-&lt;right&gt;"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'buf-move-right<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-M-&lt;left&gt;"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'buf-move-left<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-M-&lt;up&gt;"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'buf-move-up<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-M-&lt;down&gt;"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'buf-move-down<span style="color: #dd0000; font-weight: bold;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> ace-window</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-S-a c"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'ace-jump-char-mode<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-S-a w"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'ace-jump-word-mode<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-S-a l"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'ace-jump-line-mode<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-S-a b"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'ace-jump-buffer<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-S-a d"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'ace-window<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-S-a W"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'ace-window<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-S-a s"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'switch-window<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-W"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'switch-window<span style="color: #dd0000; font-weight: bold;">)</span> <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">related to  ace-window s-w</span>
</pre>
</div>
</div>
</div>
