MASTER_FILE.html
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Hide-show block  code</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #dd0000; font-weight: bold;">(</span><span style="color: #a1db00; font-weight: bold;">defun</span> <span style="color: #ffd700;">my-toggle-hideshow-all</span> <span style="color: #5fafd7; font-weight: bold;">()</span>
  <span style="color: #ff4b4b;">"Toggle hideshow all."</span>
  <span style="color: #5fafd7; font-weight: bold;">(</span>interactive<span style="color: #5fafd7; font-weight: bold;">)</span>
  <span style="color: #5fafd7; font-weight: bold;">(</span>set <span style="color: #a1db00; font-weight: bold;">(</span>make-variable-buffer-local 'my-hs-hide<span style="color: #a1db00; font-weight: bold;">)</span> <span style="color: #a1db00; font-weight: bold;">(</span>not my-hs-hide<span style="color: #a1db00; font-weight: bold;">)</span><span style="color: #5fafd7; font-weight: bold;">)</span>
  <span style="color: #5fafd7; font-weight: bold;">(</span><span style="color: #a1db00; font-weight: bold;">if</span> my-hs-hide
      <span style="color: #a1db00; font-weight: bold;">(</span>hs-hide-all<span style="color: #a1db00; font-weight: bold;">)</span>
    <span style="color: #a1db00; font-weight: bold;">(</span>hs-show-all<span style="color: #a1db00; font-weight: bold;">)</span><span style="color: #5fafd7; font-weight: bold;">)</span><span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c @ @"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'my-toggle-hideshow-all<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c @ h"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'hs-hide-block<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c @ s"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'hs-show-block<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c @ SPC"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'hs-show-block<span style="color: #dd0000; font-weight: bold;">)</span>
</pre>
</div>
</div>
</div>
</div>
