MASTER_FILE.org
* Org-sc Keys  [[file:~/.emacs.d/personal/postload/015_org-sc.el][org-sc.el  ]]  :org: :org-sc:
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "H-c l") 'sclang-start)
(global-set-key (kbd "H-c w") 'sclang-switch-to-workspace)
(global-set-key (kbd "C-c C-,") 'sclang-eval-line)
(global-set-key (kbd "C-c C-M-,") 'sclang-eval-line-inspect)
(global-set-key (kbd "M-P") 'sclang-clear-post-buffer)
(global-set-key (kbd "H-c >") 'sclang-show-post-buffer)
(global-set-key (kbd "H-c H-y") 'sclang-open-help-gui)
(global-set-key (kbd "H-c :") 'sclang-find-definitions)
(global-set-key (kbd "H-c t") 'org-sc-synthtemplate-gui)
(global-set-key (kbd "H-c H-t") 'org-sc-templates-gui)
(global-set-key (kbd "H-c H-g") 'org-sc-guis)
(global-set-key (kbd "H-c p") 'org-sc-patterntemplate-gui)
(global-set-key (kbd "H-c c") 'org-sc-select-synthtree-then-synthPlayer)
(global-set-key (kbd "H-c H-c") 'org-sc-synthPlayer-into-last-synthtree)
(global-set-key (kbd "H-c k") 'org-sc-select-synthtree-then-knobs)
(global-set-key (kbd "H-c f") 'org-sc-faders)
;; (global-set-key (kbd "H-c H-f") 'org-sc-set-global-fade-time)
;; (global-set-key (kbd "H-c H-C-f") 'org-sc-set-fade-time)
(global-set-key (kbd "H-c SPC") 'org-sc-toggle-section-synthtree)
(global-set-key (kbd "H-SPC") 'org-sc-toggle-section-synthtree)
(global-set-key (kbd "H-c H-SPC") 'org-sc-toggle-section-synthtree)
(global-set-key (kbd "H-c g") 'org-sc-start-synthtree)
(global-set-key (kbd "H-c s") 'org-sc-stop-synthtree)
(global-set-key (kbd "H-c H-s") 'org-sc-stop-last-synthtree)
(global-set-key (kbd "H-b g") 'org-sc-play-buffer)
(global-set-key (kbd "H-b l") 'org-sc-load-buffer)
(global-set-key (kbd "H-b L") 'org-sc-show-buffer-list)
(global-set-key (kbd "H-b o") 'org-sc-open-buffer-list)
(global-set-key (kbd "H-b s") 'org-sc-save-buffer-list)
(global-set-key (kbd "H-b f") 'org-sc-free-buffer)

h(eval-after-load "org"
  ;; move / eval / synthPlayer sections
  '(progn
     (define-key org-mode-map (kbd "H-C-SPC") 'org-sc-eval-this-section)
     (define-key org-mode-map (kbd "H-M-SPC") 'org-sc-synthPlayer-this-section)
     (define-key org-mode-map (kbd "H-s n") 'org-sc-next-section)
     (define-key org-mode-map (kbd "H-s p") 'org-sc-previous-section)
     (define-key org-mode-map (kbd "H-C-n") 'org-sc-eval-next-section)
     (define-key org-mode-map (kbd "H-C-p") 'org-sc-eval-previous-section)
     (define-key org-mode-map (kbd "H-M-n") 'org-sc-synthPlayer-next-section)
     (define-key org-mode-map (kbd "H-M-p") 'org-sc-synthPlayer-previous-section)
     ;; same level movement: up and down arrow keys
     (define-key org-mode-map (kbd "H-j") 'org-sc-next-same-level-section)
     (define-key org-mode-map (kbd "H-k") 'org-sc-previous-same-level-section)
     (define-key org-mode-map (kbd "H-C-j") 'org-sc-eval-next-same-level-section)
     (define-key org-mode-map (kbd "H-C-k") 'org-sc-eval-previous-same-level-section)
     (define-key org-mode-map (kbd "H-M-j") 'org-sc-synthPlayer-next-same-level-section)
     (define-key org-mode-map (kbd "H-M-k") 'org-sc-synthPlayer-previous-same-level-section)
     ;; more stuff:
     (define-key org-mode-map (kbd "C-M-x") 'org-sc-eval)
     (define-key org-mode-map (kbd "C-c C-,") 'sclang-eval-line)
     ;; 9 because in the us keyboard it is below open paren:
     (define-key org-mode-map (kbd "C-c C-9") 'sclang-eval-dwim)
     (define-key org-mode-map (kbd "C-M-z") 'org-sc-stop-section-processes)
     (define-key org-mode-map (kbd "H-C-x") 'org-sc-eval-in-routine)
     ;; convenient parallel to H-C-x:
     (define-key org-mode-map (kbd "H-C-z") 'org-sc-stop-section-processes)
     (define-key org-mode-map (kbd "C-M-n") 'org-sc-eval-next)
     (define-key org-mode-map (kbd "C-M-p") 'org-sc-eval-previous)
     ;; this overrides the default binding org-schedule, which I do not use often:
     (define-key org-mode-map (kbd "C-c C-s") 'sclang-main-stop)
     (define-key org-mode-map (kbd "H-C-r") 'sclang-process-registry-gui)
     (define-key org-mode-map (kbd "C-c C-M-.") 'org-sc-stop-section-processes)

     (define-key org-mode-map (kbd "C-c C-x l") 'org-sc-toggle-autoload)
     (define-key org-mode-map (kbd "C-c C-x C-l") 'org-sc-load-marked)
     (define-key org-mode-map (kbd "H-C-o") 'org-sc-toggle-mode))[[
#+END_SRC
