MASTER_FILE.html
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Org-sc Keys  <a href="file:///home/egelor/.emacs.d/personal/postload/015_org-sc.el">org-sc.el  </a>  :org: :org-sc:</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-c l"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'sclang-start<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-c w"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'sclang-switch-to-workspace<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c C-,"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'sclang-eval-line<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c C-M-,"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'sclang-eval-line-inspect<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"M-P"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'sclang-clear-post-buffer<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-c &gt;"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'sclang-show-post-buffer<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-c H-y"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'sclang-open-help-gui<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-c :"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'sclang-find-definitions<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-c t"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-synthtemplate-gui<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-c H-t"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-templates-gui<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-c H-g"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-guis<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-c p"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-patterntemplate-gui<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-c c"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-select-synthtree-then-synthPlayer<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-c H-c"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-synthPlayer-into-last-synthtree<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-c k"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-select-synthtree-then-knobs<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-c f"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-faders<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">(global-set-key (kbd "H-c H-f") 'org-sc-set-global-fade-time)</span>
<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">(global-set-key (kbd "H-c H-C-f") 'org-sc-set-fade-time)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-c SPC"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-toggle-section-synthtree<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-SPC"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-toggle-section-synthtree<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-c H-SPC"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-toggle-section-synthtree<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-c g"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-start-synthtree<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-c s"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-stop-synthtree<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-c H-s"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-stop-last-synthtree<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-b g"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-play-buffer<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-b l"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-load-buffer<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-b L"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-show-buffer-list<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-b o"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-open-buffer-list<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-b s"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-save-buffer-list<span style="color: #dd0000; font-weight: bold;">)</span>
<span style="color: #dd0000; font-weight: bold;">(</span>global-set-key <span style="color: #5fafd7; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-b f"</span><span style="color: #5fafd7; font-weight: bold;">)</span> 'org-sc-free-buffer<span style="color: #dd0000; font-weight: bold;">)</span>

h<span style="color: #dd0000; font-weight: bold;">(</span>eval-after-load <span style="color: #ff4ea3;">"org"</span>
  <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">move / eval / synthPlayer sections</span>
  '<span style="color: #5fafd7; font-weight: bold;">(</span><span style="color: #a1db00; font-weight: bold;">progn</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-C-SPC"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-eval-this-section<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-M-SPC"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-synthPlayer-this-section<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-s n"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-next-section<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-s p"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-previous-section<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-C-n"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-eval-next-section<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-C-p"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-eval-previous-section<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-M-n"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-synthPlayer-next-section<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-M-p"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-synthPlayer-previous-section<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">same level movement: up and down arrow keys</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-j"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-next-same-level-section<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-k"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-previous-same-level-section<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-C-j"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-eval-next-same-level-section<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-C-k"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-eval-previous-same-level-section<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-M-j"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-synthPlayer-next-same-level-section<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-M-k"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-synthPlayer-previous-same-level-section<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">more stuff:</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-M-x"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-eval<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c C-,"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'sclang-eval-line<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">9 because in the us keyboard it is below open paren:</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c C-9"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'sclang-eval-dwim<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-M-z"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-stop-section-processes<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-C-x"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-eval-in-routine<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">convenient parallel to H-C-x:</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-C-z"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-stop-section-processes<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-M-n"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-eval-next<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-M-p"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-eval-previous<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">this overrides the default binding org-schedule, which I do not use often:</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c C-s"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'sclang-main-stop<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-C-r"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'sclang-process-registry-gui<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c C-M-."</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-stop-section-processes<span style="color: #a1db00; font-weight: bold;">)</span>

     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c C-x l"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-toggle-autoload<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c C-x C-l"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-load-marked<span style="color: #a1db00; font-weight: bold;">)</span>
     <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"H-C-o"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sc-toggle-mode<span style="color: #a1db00; font-weight: bold;">)</span><span style="color: #5fafd7; font-weight: bold;">)[</span><span style="color: #a1db00; font-weight: bold;">[</span>
</pre>
</div>
</div>
</div>
