MASTER_FILE.org
* Org-mode Keys :keys:
#+BEGIN_SRC emacs-lisp
 ;; This is run once after loading org for the first time
  ;; It adds some org-mode specific key bindings.
  (eval-after-load 'org
    '(progn
       ;; alias for org-cycle, more convenient than TAB
       (define-key org-mode-map (kbd "C-H-c") 'org-cycle)
       ;; Note: This keybinding is in analogy to the default keybinding:
       ;; C-c . -> org-time-stamp
       (define-key org-mode-map (kbd "C-c C-.") 'org-set-date)
       (define-key org-mode-map (kbd "C-M-{") 'backward-paragraph)
       (define-key org-mode-map (kbd "C-M-}") 'forward-paragraph)
       (define-key org-mode-map (kbd "C-c C-S") 'org-schedule)
       (define-key org-mode-map (kbd "C-c C-s") 'sclang-main-stop)
       (define-key org-mode-map (kbd "C-c >") 'sclang-show-post-buffer)
       ;; own additions after org-config-examples below:
       (define-key org-mode-map (kbd "C-M-S-n") 'org-next-src-block)
       (define-key org-mode-map (kbd "C-M-S-p") 'org-show-properties-block)
       (define-key org-mode-map (kbd "C-M-/") 'org-sclang-eval-babel-block)
              ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
       ;; from: http://orgmode.org/worg/org-configs/org-config-examples.html
       ;; section navigation
       (define-key org-mode-map (kbd "M-n") 'jump-outline-next-visible-heading)
       (define-key org-mode-map (kbd "C-M-n") 'jump-outline-next-visible-heading-and-cycle)
       (define-key org-mode-map (kbd "M-p") 'jump-outline-previous-visible-heading)
       (define-key org-mode-map (kbd "C-M-p") 'jump-outline-previous-visible-heading-and-cycle)
       (define-key org-mode-map (kbd "C-M-f") 'org-jump-forward-heading-same-level)
       (define-key org-mode-map (kbd "C-M-b") 'org-jump-backward-heading-same-level)
       (define-key org-mode-map (kbd "C-M-u") 'jump-outline-up-heading)
       ;; table
       (define-key org-mode-map (kbd "C-M-w") 'org-table-copy-region)
       (define-key org-mode-map (kbd "C-M-y") 'org-table-paste-rectangle)
       (define-key org-mode-map (kbd "C-M-l") 'org-table-sort-lines)
       ;; display images
       (define-key org-mode-map (kbd "M-I") 'org-toggle-iimage-in-org)
       ;; Following are the prelude-mode binding, minus the conflicting table bindings.
       ;; prelude-mode is turned off for org mode, below.
       (define-key org-mode-map (kbd "C-c o") 'crux-open-with)
       ;; (define-key org-mode-map (kbd "C-c g") 'prelude-google)
       ;; (define-key org-mode-map (kbd "C-c G") 'crux-github)
       ;; (define-key org-mode-map (kbd "C-c y") 'prelude-youtube)
       ;; (define-key org-mode-map (kbd "C-c U") 'prelude-duckduckgo)
       ;;     ;; mimic popular IDEs binding, note that it doesn't work in a terminal session
       (define-key org-mode-map [(shift return)] 'crux-smart-open-line)
       (define-key org-mode-map (kbd "M-o") 'crux-smart-open-line)
       (define-key org-mode-map [(control shift return)] 'crux-smart-open-line-above)
       (define-key org-mode-map [(control shift up)]  'move-text-up)
       (define-key org-mode-map [(control shift down)]  'move-text-down)
       (define-key org-mode-map [(control meta shift up)]  'move-text-up)
       (define-key org-mode-map [(control meta shift down)]  'move-text-down)
       ;;     ;; the following 2 break structure editing with meta-shift-up / down in org mode
       ;;     ;;    (define-key map [(meta shift up)]  'move-text-up)
       ;;     ;;    (define-key map [(meta shift down)]  'move-text-down)
       ;;     ;; new substitutes for above:  (these are overwritten by other modes...)
       ;;     ;; (define-key map (kbd "C-c [")  'move-text-up)
       ;;     ;; (define-key map (kbd "C-c ]")  'move-text-down)
       ;;     ;; (define-key map [(control meta shift up)]  'move-text-up)
       ;;     ;; (define-key map [(control meta shift down)]  'move-text-down)
       (define-key org-mode-map (kbd "C-c n") 'crux-cleanup-buffer-or-region)
       (define-key org-mode-map (kbd "C-c f") 'crux-recentf-ido-find-file)
       (define-key org-mode-map (kbd "C-M-z") 'crux-indent-defun)
       (define-key org-mode-map (kbd "C-c u") 'crux-view-url)
       (define-key org-mode-map (kbd "C-c e") 'crux-eval-and-replace)
       (define-key org-mode-map (kbd "C-c s") 'crux-swap-windows)
       (define-key org-mode-map (kbd "C-c D") 'crux-delete-file-and-buffer)
       (define-key org-mode-map (kbd "C-c d") 'crux-duplicate-current-line-or-region)
       (define-key org-mode-map (kbd "C-c M-d") 'crux-duplicate-and-comment-current-line-or-region)
       (define-key org-mode-map (kbd "C-c r") 'crux-rename-buffer-and-file)
       (define-key org-mode-map (kbd "C-c t") 'crux-visit-term-buffer)
       (define-key org-mode-map (kbd "C-c k") 'crux-kill-other-buffers)
       ;;     ;; another annoying overwrite of a useful org-mode command:
       ;;     ;; (define-key map (kbd "C-c TAB") 'prelude-indent-rigidly-and-copy-to-clipboard)
       (define-key org-mode-map (kbd "C-c I") 'crux-find-user-init-file)
       (define-key org-mode-map (kbd "C-c S") 'crux-find-shell-init-file)
       ;; replace not functioning 'prelude-goto-symbol with useful imenu-anywhere
       (define-key org-mode-map (kbd "C-c i") 'imenu-anywhere)
       ;;     ;; extra prefix for projectile
       (define-key org-mode-map (kbd "s-p") 'projectile-command-map)
       ;;     ;; make some use of the Super key
       (define-key org-mode-map (kbd "s-g") 'god-local-mode)
       (define-key org-mode-map (kbd "s-r") 'crux-recentf-ido-find-file)
       (define-key org-mode-map (kbd "s-j") 'crux-top-join-line)
       (define-key org-mode-map (kbd "s-k") 'crux-kill-whole-line)
       (define-key org-mode-map (kbd "s-m m") 'magit-status)
       (define-key org-mode-map (kbd "s-m l") 'magit-log)
       (define-key org-mode-map (kbd "s-m f") 'magit-log-buffer-file)
       (define-key org-mode-map (kbd "s-m b") 'magit-blame)
       (define-key org-mode-map (kbd "s-o") 'crux-smart-open-line-above)
       ))

#+END_SRC

#+RESULTS:
: crux-smart-open-line-above
