MASTER_FILE.html
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Org-mode Keys&#xa0;&#xa0;&#xa0;<span class="tag"><span class="keys">keys</span></span></h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">This is run once after loading org for the first time</span>
 <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">It adds some org-mode specific key bindings.</span>
 <span style="color: #dd0000; font-weight: bold;">(</span>eval-after-load 'org
   '<span style="color: #5fafd7; font-weight: bold;">(</span><span style="color: #a1db00; font-weight: bold;">progn</span>
      <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">alias for org-cycle, more convenient than TAB</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-H-c"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-cycle<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">Note: This keybinding is in analogy to the default keybinding:</span>
      <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">C-c . -&gt; org-time-stamp</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c C-."</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-set-date<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-M-{"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'backward-paragraph<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-M-}"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'forward-paragraph<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c C-S"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-schedule<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c C-s"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'sclang-main-stop<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c &gt;"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'sclang-show-post-buffer<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">own additions after org-config-examples below:</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-M-S-n"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-next-src-block<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-M-S-p"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-show-properties-block<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-M-/"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-sclang-eval-babel-block<span style="color: #a1db00; font-weight: bold;">)</span>
             <span style="color: #6c6c6c; font-style: italic;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
      <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">from: http://orgmode.org/worg/org-configs/org-config-examples.html</span>
      <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">section navigation</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"M-n"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'jump-outline-next-visible-heading<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-M-n"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'jump-outline-next-visible-heading-and-cycle<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"M-p"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'jump-outline-previous-visible-heading<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-M-p"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'jump-outline-previous-visible-heading-and-cycle<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-M-f"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-jump-forward-heading-same-level<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-M-b"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-jump-backward-heading-same-level<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-M-u"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'jump-outline-up-heading<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">table</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-M-w"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-table-copy-region<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-M-y"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-table-paste-rectangle<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-M-l"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-table-sort-lines<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">display images</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"M-I"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'org-toggle-iimage-in-org<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">Following are the prelude-mode binding, minus the conflicting table bindings.</span>
      <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">prelude-mode is turned off for org mode, below.</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c o"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-open-with<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">(define-key org-mode-map (kbd "C-c g") 'prelude-google)</span>
      <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">(define-key org-mode-map (kbd "C-c G") 'crux-github)</span>
      <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">(define-key org-mode-map (kbd "C-c y") 'prelude-youtube)</span>
      <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">(define-key org-mode-map (kbd "C-c U") 'prelude-duckduckgo)</span>
      <span style="color: #6c6c6c; font-style: italic;">;;     </span><span style="color: #6c6c6c; font-style: italic;">;; mimic popular IDEs binding, note that it doesn't work in a terminal session</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">[</span><span style="color: #00d7af; font-weight: bold;">(</span>shift return<span style="color: #00d7af; font-weight: bold;">)</span><span style="color: #ff4ea3; font-weight: bold;">]</span> 'crux-smart-open-line<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"M-o"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-smart-open-line<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">[</span><span style="color: #00d7af; font-weight: bold;">(</span>control shift return<span style="color: #00d7af; font-weight: bold;">)</span><span style="color: #ff4ea3; font-weight: bold;">]</span> 'crux-smart-open-line-above<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">[</span><span style="color: #00d7af; font-weight: bold;">(</span>control shift up<span style="color: #00d7af; font-weight: bold;">)</span><span style="color: #ff4ea3; font-weight: bold;">]</span>  'move-text-up<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">[</span><span style="color: #00d7af; font-weight: bold;">(</span>control shift down<span style="color: #00d7af; font-weight: bold;">)</span><span style="color: #ff4ea3; font-weight: bold;">]</span>  'move-text-down<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">[</span><span style="color: #00d7af; font-weight: bold;">(</span>control meta shift up<span style="color: #00d7af; font-weight: bold;">)</span><span style="color: #ff4ea3; font-weight: bold;">]</span>  'move-text-up<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">[</span><span style="color: #00d7af; font-weight: bold;">(</span>control meta shift down<span style="color: #00d7af; font-weight: bold;">)</span><span style="color: #ff4ea3; font-weight: bold;">]</span>  'move-text-down<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #6c6c6c; font-style: italic;">;;     </span><span style="color: #6c6c6c; font-style: italic;">;; the following 2 break structure editing with meta-shift-up / down in org mode</span>
      <span style="color: #6c6c6c; font-style: italic;">;;     </span><span style="color: #6c6c6c; font-style: italic;">;;    (define-key map [(meta shift up)]  'move-text-up)</span>
      <span style="color: #6c6c6c; font-style: italic;">;;     </span><span style="color: #6c6c6c; font-style: italic;">;;    (define-key map [(meta shift down)]  'move-text-down)</span>
      <span style="color: #6c6c6c; font-style: italic;">;;     </span><span style="color: #6c6c6c; font-style: italic;">;; new substitutes for above:  (these are overwritten by other modes...)</span>
      <span style="color: #6c6c6c; font-style: italic;">;;     </span><span style="color: #6c6c6c; font-style: italic;">;; (define-key map (kbd "C-c [")  'move-text-up)</span>
      <span style="color: #6c6c6c; font-style: italic;">;;     </span><span style="color: #6c6c6c; font-style: italic;">;; (define-key map (kbd "C-c ]")  'move-text-down)</span>
      <span style="color: #6c6c6c; font-style: italic;">;;     </span><span style="color: #6c6c6c; font-style: italic;">;; (define-key map [(control meta shift up)]  'move-text-up)</span>
      <span style="color: #6c6c6c; font-style: italic;">;;     </span><span style="color: #6c6c6c; font-style: italic;">;; (define-key map [(control meta shift down)]  'move-text-down)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c n"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-cleanup-buffer-or-region<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c f"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-recentf-ido-find-file<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-M-z"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-indent-defun<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c u"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-view-url<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c e"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-eval-and-replace<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c s"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-swap-windows<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c D"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-delete-file-and-buffer<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c d"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-duplicate-current-line-or-region<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c M-d"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-duplicate-and-comment-current-line-or-region<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c r"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-rename-buffer-and-file<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c t"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-visit-term-buffer<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c k"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-kill-other-buffers<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #6c6c6c; font-style: italic;">;;     </span><span style="color: #6c6c6c; font-style: italic;">;; another annoying overwrite of a useful org-mode command:</span>
      <span style="color: #6c6c6c; font-style: italic;">;;     </span><span style="color: #6c6c6c; font-style: italic;">;; (define-key map (kbd "C-c TAB") 'prelude-indent-rigidly-and-copy-to-clipboard)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c I"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-find-user-init-file<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c S"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-find-shell-init-file<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">replace not functioning 'prelude-goto-symbol with useful imenu-anywhere</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"C-c i"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'imenu-anywhere<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #6c6c6c; font-style: italic;">;;     </span><span style="color: #6c6c6c; font-style: italic;">;; extra prefix for projectile</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-p"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'projectile-command-map<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #6c6c6c; font-style: italic;">;;     </span><span style="color: #6c6c6c; font-style: italic;">;; make some use of the Super key</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-g"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'god-local-mode<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-r"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-recentf-ido-find-file<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-j"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-top-join-line<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-k"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-kill-whole-line<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-m m"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'magit-status<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-m l"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'magit-log<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-m f"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'magit-log-buffer-file<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-m b"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'magit-blame<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #a1db00; font-weight: bold;">(</span>define-key org-mode-map <span style="color: #ff4ea3; font-weight: bold;">(</span>kbd <span style="color: #ff4ea3;">"s-o"</span><span style="color: #ff4ea3; font-weight: bold;">)</span> 'crux-smart-open-line-above<span style="color: #a1db00; font-weight: bold;">)</span>
      <span style="color: #5fafd7; font-weight: bold;">)</span><span style="color: #dd0000; font-weight: bold;">)</span>
</pre>
</div>
</div>
</div>
