MASTER_FILE.org
* 011_untangle_tangle.el
* COMMENT prelude-customization
  s-r   //prelude-recentf-ido-find-file
(define-key map (kbd "C-c f")  'prelude-recentf-ido-find-file)
#+BEGIN_SRC emacs-lisp   Prelude-mode map
  (setq prelude-whitespace nil)
  ;; undo prelude shift-meta-up/down keybindings which interfere with org-mode
   (setq prelude-mode-map
      (let ((map (make-sparse-keymap)))
       (define-key map (kbd "C-c o") 'prelude-open-with)
       (define-key map (kbd "C-c g") 'prelude-google)
       (define-key map (kbd "C-c G") 'prelude-github)
       (define-key map (kbd "C-c y") 'prelude-youtube)
       (define-key map (kbd "C-c U") 'prelude-duckduckgo)
  ;;     ;; mimic popular IDEs binding, note that it doesn't work in a terminal session
       (define-key map [(shift return)] 'prelude-smart-open-line)
       (define-key map (kbd "M-o") 'prelude-smart-open-line)
       (define-key map [(control shift return)] 'prelude-smart-open-line-above)
       (define-key map [(control shift up)]  'move-text-up)
       (define-key map [(control shift down)]  'move-text-down)
  ;;     ;; the following 2 break structure editing with meta-shift-up / down in org mode
  ;;     ;;    (define-key map [(meta shift up)]  'move-text-up)
  ;;     ;;    (define-key map [(meta shift down)]  'move-text-down)
  ;;     ;; new substitutes for above:  (these are overwritten by other modes...)
  ;;     ;; (define-key map (kbd "C-c [")  'move-text-up)
  ;;     ;; (define-key map (kbd "C-c ]")  'move-text-down)
  ;;     ;; (define-key map [(control meta shift up)]  'move-text-up)
  ;;     ;; (define-key map [(control meta shift down)]  'move-text-down)
       (define-key map (kbd "C-c n") 'prelude-cleanup-buffer-or-region)
       (define-key map (kbd "C-c f")  'prelude-recentf-ido-find-file)
       (define-key map (kbd "C-M-z") 'prelude-indent-defun)
       (define-key map (kbd "C-c u") 'prelude-view-url)
       (define-key map (kbd "C-c e") 'prelude-eval-and-replace)
       (define-key map (kbd "C-c s") 'prelude-swap-windows)
       (define-key map (kbd "C-c D") 'prelude-delete-file-and-buffer)
       (define-key map (kbd "C-c d") 'prelude-duplicate-current-line-or-region)
       (define-key map (kbd "C-c M-d") 'prelude-duplicate-and-comment-current-line-or-region)
       (define-key map (kbd "C-c r") 'prelude-rename-buffer-and-file)
       (define-key map (kbd "C-c t") 'prelude-visit-term-buffer)
       (define-key map (kbd "C-c k") 'prelude-kill-other-buffers)
  ;;     ;; another annoying overwrite of a useful org-mode command:
  ;;     ;; (define-key map (kbd "C-c TAB") 'prelude-indent-rigidly-and-copy-to-clipboard)
       (define-key map (kbd "C-c I") 'prelude-find-user-init-file)
       (define-key map (kbd "C-c S") 'prelude-find-shell-init-file)
       (define-key map (kbd "C-c i") 'prelude-goto-symbol)
  ;;     ;; extra prefix for projectile
       (define-key map (kbd "s-p") 'projectile-command-map)
  ;;     ;; make some use of the Super key
       (define-key map (kbd "s-g") 'god-local-mode)
       (define-key map (kbd "s-r") 'prelude-recentf-ido-find-file)
       (define-key map (kbd "s-j") 'prelude-top-join-line)
       (define-key map (kbd "s-k") 'prelude-kill-whole-line)
       (define-key map (kbd "s-m m") 'magit-status)
       (define-key map (kbd "s-m l") 'magit-log)
       (define-key map (kbd "s-m f") 'magit-log-buffer-file)
       (define-key map (kbd "s-m b") 'magit-blame)
       (define-key map (kbd "s-o") 'prelude-smart-open-line-above)
       map))
#+END_SRC

#+RESULTS:
| keymap | (8388719 . prelude-smart-open-line-above) | (8388717 keymap (98 . magit-blame) (102 . magit-log-buffer-file) (108 . magit-log) (109 . magit-status)) | (8388715 . prelude-kill-whole-line) | (8388714 . prelude-top-join-line) | (8388722 . prelude-recentf-ido-find-file) | (8388711 . god-local-mode) | (8388720 . projectile-command-map) | (C-S-down . move-text-down) | (C-S-up . move-text-up) | (C-S-return . prelude-smart-open-line-above) | (27 keymap (26 . prelude-indent-defun) (111 . prelude-smart-open-line)) | (S-return . prelude-smart-open-line) | (3 keymap (105 . prelude-goto-symbol) (83 . prelude-find-shell-init-file) (73 . prelude-find-user-init-file) (107 . prelude-kill-other-buffers) (116 . prelude-visit-term-buffer) (114 . prelude-rename-buffer-and-file) (27 keymap (100 . prelude-duplicate-and-comment-current-line-or-region)) (100 . prelude-duplicate-current-line-or-region) (68 . prelude-delete-file-and-buffer) (115 . prelude-swap-windows) (101 . prelude-eval-and-replace) (117 . prelude-view-url) (102 . prelude-recentf-ido-find-file) (110 . prelude-cleanup-buffer-or-region) (85 . prelude-duckduckgo) (121 . prelude-youtube) (71 . prelude-github) (103 . prelude-google) (111 . prelude-open-with)) |

* Artistic outputs and buggs
** sclang
init_OSC
empty
compiling class library...
	NumPrimitives = 679
	compiling dir: '/usr/share/SuperCollider/SCClassLibrary'
	compiling dir: '/usr/share/SuperCollider/Extensions'
	compiling dir: '/home/egelor/.local/share/SuperCollider/Extensions'
	pass 1 done
	numentries = 1677367 / 34017230 = 0.049
	8441 method selectors, 4030 classes
	method table size 30748832 bytes, big table size 272137840
	Number of Symbols 20637
	Byte Code Size 865803
	compiled 853 files in 3.63 seconds

Info: 6 methods are currently overwritten by extensions. To see which, execute:
MethodOverride.printAll

compile done
Emacs: Initializing lisp interface.
MP3.lamepath automatically set to /usr/bin/lame
WARNING: 'oggdec' executable not found. Please modify the MP3:oggdecpath class variable.
Help tree read from cache in 0.12415719032288 seconds
LID: event loop started
Class tree inited in 0.51 seconds

 ================ STARTING FILE LOADING ================

 ================ FILE LOADING DONE ================

RESULT = 0
Welcome to SuperCollider 3.6.6. For help type C-c C-y.
Emacs: Index help topics in 1.69 seconds
Emacs: Built symbol table in 0.193 seconds
booting 57110
localhost
Faust: supercollider.cpp: sc_api_version = 2
Faust: FaustJPverbRaw numControls=11
Faust: supercollider.cpp: sc_api_version = 2
Faust: FaustGreyholeRaw numControls=7
VST_PATH not set, defaulting to /home/egelor/vst:/usr/local/lib/vst:/usr/lib/vst
DSSI_PATH not set, defaulting to /home/egelor/.dssi:/usr/local/lib/dssi:/usr/lib/dssi
DSSIVSTPlugin: Error on plugin query: Failed to find dssi-vst-scanner executable
Found 10 LADSPA plugins
JackDriver: client name is 'Jack Router'
SC_AudioDriver: sample rate = 44100.000000, driver's block size = 256

** jack_lsp -c
MIC:                          system:capture_1
Firefox:Chrome:   PulseAudio JACK Source:front-left
Mic_In:                     Jack Router:in_1
Mic_In:                     Jack Router:in_3
InstrumentOrMic: system:capture_2
InstrumentOrMic: Jack Router:in_2
                                   Jack Router:in_4
system:playback_1
   Jack Router:out_3
system:playback_2
   Jack Router:out_4
system:playback_3
   Jack Router:out_3
system:playback_4
   Jack Router:out_4
netjack:capture_1
   Jack Router:in_11
netjack:capture_2
   Jack Router:in_12
netjack:capture_3
netjack:playback_1
netjack:playback_2
   Jack Router:out_2
netjack:playback_3
netjack-01:capture_1
   Jack Router:in_9
netjack-01:capture_2
   Jack Router:in_10
netjack-01:capture_3
netjack-01:playback_1
   Jack Router:out_5
netjack-01:playback_2
   Jack Router:out_6
netjack-01:playback_3
Jack Router:in_1
   system:capture_1
Jack Router:in_2
   system:capture_2
Jack Router:in_3
   system:capture_1
Jack Router:in_4
   system:capture_2
Jack Router:in_5
Jack Router:in_6
Jack Router:in_7
   PulseAudio JACK Sink:front-left
Jack Router:in_8
   PulseAudio JACK Sink:front-right
Jack Router:in_9
   netjack-01:capture_1
Jack Router:in_10
   netjack-01:capture_2
Jack Router:in_11
   netjack:capture_1
Jack Router:in_12
   netjack:capture_2
Jack Router:out_1
Jack Router:out_2
   netjack:playback_2
Jack Router:out_3
   system:playback_3
   system:playback_1
Jack Router:out_4
   system:playback_4
   system:playback_2
Jack Router:out_5
   netjack-01:playback_1
Jack Router:out_6
   netjack-01:playback_2
Jack Router:out_7
Jack Router:out_8
PulseAudio JACK Sink:front-left
   Jack Router:in_7
PulseAudio JACK Sink:front-right
   Jack Router:in_8
PulseAudio JACK Source:front-left
   system:capture_1
PulseAudio JACK Source:front-right
   system:capture_2
