MASTER_FILE.html
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 011<sub>untangle</sub><sub>tangle</sub>.el</h2>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Artistic outputs and buggs</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> sclang</h3>
<div class="outline-text-3" id="text-10-1">
<p>
init<sub>OSC</sub>
empty
compiling class library&#x2026;
        NumPrimitives = 679
        compiling dir: '/usr/share/SuperCollider/SCClassLibrary'
        compiling dir: '<i>usr/share/SuperCollider/Extensions'
        compiling dir: '/home/egelor</i>.local/share/SuperCollider/Extensions'
        pass 1 done
        numentries = 1677367 / 34017230 = 0.049
        8441 method selectors, 4030 classes
        method table size 30748832 bytes, big table size 272137840
        Number of Symbols 20637
        Byte Code Size 865803
        compiled 853 files in 3.63 seconds
</p>

<p>
Info: 6 methods are currently overwritten by extensions. To see which, execute:
MethodOverride.printAll
</p>

<p>
compile done
Emacs: Initializing lisp interface.
MP3.lamepath automatically set to /usr/bin/lame
WARNING: 'oggdec' executable not found. Please modify the MP3:oggdecpath class variable.
Help tree read from cache in 0.12415719032288 seconds
LID: event loop started
Class tree inited in 0.51 seconds
</p>

<p>
<code>==============</code> STARTING FILE LOADING <code>==============</code>
</p>

<p>
<code>==============</code> FILE LOADING DONE <code>==============</code>
</p>

<p>
RESULT = 0
Welcome to SuperCollider 3.6.6. For help type C-c C-y.
Emacs: Index help topics in 1.69 seconds
Emacs: Built symbol table in 0.193 seconds
booting 57110
localhost
Faust: supercollider.cpp: sc<sub>api</sub><sub>version</sub> = 2
Faust: FaustJPverbRaw numControls=11
Faust: supercollider.cpp: sc<sub>api</sub><sub>version</sub> = 2
Faust: FaustGreyholeRaw numControls=7
VST<sub>PATH</sub> not set, defaulting to <i>home/egelor/vst:/usr/local/lib/vst:/usr/lib/vst
DSSI<sub>PATH</sub> not set, defaulting to /home/egelor</i>.dssi:/usr/local/lib/dssi:/usr/lib/dssi
DSSIVSTPlugin: Error on plugin query: Failed to find dssi-vst-scanner executable
Found 10 LADSPA plugins
JackDriver: client name is 'Jack Router'
SC<sub>AudioDriver</sub>: sample rate = 44100.000000, driver's block size = 256
</p>
</div>
</div>

<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> jack<sub>lsp</sub> -c</h3>
<div class="outline-text-3" id="text-10-2">
<p>
MIC:                          system:capture<sub>1</sub>
Firefox:Chrome:   PulseAudio JACK Source:front-left
Mic<sub>In</sub>:                     Jack Router:in<sub>1</sub>
Mic<sub>In</sub>:                     Jack Router:in<sub>3</sub>
InstrumentOrMic: system:capture<sub>2</sub>
InstrumentOrMic: Jack Router:in<sub>2</sub>
                                   Jack Router:in<sub>4</sub>
system:playback<sub>1</sub>
   Jack Router:out<sub>3</sub>
system:playback<sub>2</sub>
   Jack Router:out<sub>4</sub>
system:playback<sub>3</sub>
   Jack Router:out<sub>3</sub>
system:playback<sub>4</sub>
   Jack Router:out<sub>4</sub>
netjack:capture<sub>1</sub>
   Jack Router:in<sub>11</sub>
netjack:capture<sub>2</sub>
   Jack Router:in<sub>12</sub>
netjack:capture<sub>3</sub>
netjack:playback<sub>1</sub>
netjack:playback<sub>2</sub>
   Jack Router:out<sub>2</sub>
netjack:playback<sub>3</sub>
netjack-01:capture<sub>1</sub>
   Jack Router:in<sub>9</sub>
netjack-01:capture<sub>2</sub>
   Jack Router:in<sub>10</sub>
netjack-01:capture<sub>3</sub>
netjack-01:playback<sub>1</sub>
   Jack Router:out<sub>5</sub>
netjack-01:playback<sub>2</sub>
   Jack Router:out<sub>6</sub>
netjack-01:playback<sub>3</sub>
Jack Router:in<sub>1</sub>
   system:capture<sub>1</sub>
Jack Router:in<sub>2</sub>
   system:capture<sub>2</sub>
Jack Router:in<sub>3</sub>
   system:capture<sub>1</sub>
Jack Router:in<sub>4</sub>
   system:capture<sub>2</sub>
Jack Router:in<sub>5</sub>
Jack Router:in<sub>6</sub>
Jack Router:in<sub>7</sub>
   PulseAudio JACK Sink:front-left
Jack Router:in<sub>8</sub>
   PulseAudio JACK Sink:front-right
Jack Router:in<sub>9</sub>
   netjack-01:capture<sub>1</sub>
Jack Router:in<sub>10</sub>
   netjack-01:capture<sub>2</sub>
Jack Router:in<sub>11</sub>
   netjack:capture<sub>1</sub>
Jack Router:in<sub>12</sub>
   netjack:capture<sub>2</sub>
Jack Router:out<sub>1</sub>
Jack Router:out<sub>2</sub>
   netjack:playback<sub>2</sub>
Jack Router:out<sub>3</sub>
   system:playback<sub>3</sub>
   system:playback<sub>1</sub>
Jack Router:out<sub>4</sub>
   system:playback<sub>4</sub>
   system:playback<sub>2</sub>
Jack Router:out<sub>5</sub>
   netjack-01:playback<sub>1</sub>
Jack Router:out<sub>6</sub>
   netjack-01:playback<sub>2</sub>
Jack Router:out<sub>7</sub>
Jack Router:out<sub>8</sub>
PulseAudio JACK Sink:front-left
   Jack Router:in<sub>7</sub>
PulseAudio JACK Sink:front-right
   Jack Router:in<sub>8</sub>
PulseAudio JACK Source:front-left
   system:capture<sub>1</sub>
PulseAudio JACK Source:front-right
   system:capture<sub>2</sub>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-10-26 Πεμ&gt;</span></span></p>
<p class="author">Author: Eugene Tryfonides</p>
<p class="date">Created: 2017-10-27 Παρ 16:04</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
